head(pollution) # Просмотр первых шести строк таблицы pollution
summary(pollution$pm25) # Анализ переменной pm25 из датафрейма pollution
quantile(ppm) # Вычисляет квантильные значения для переменной ppm (pm25)
boxplot(ppm, col = "blue") # Диаграмма размаха (boxplot) для переменной ppm
abline(h=12) # Добавляет горизонтальную линию на уровне y = 12
hist(ppm, col = "green") # Построение гистограммы для переменной ppm
rug(ppm) # Добавляет одномерное распределение данных в виде штрихов
low # Выводит значения переменной low (низкие значения ppm)
high # Выводит значения переменной high (высокие значения ppm)
hist(ppm, col="green", breaks = 100) # Гистограмма с 100 столбцами
rug(ppm) # Добавляет "ковер" под гистограмму
hist(ppm, col = "green") # Гистограмма с зелеными столбцами
abline(v=12, lwd=2) # Вертикальная линия на x = 12 толщиной 2
abline(v=median(ppm), col="magenta", lwd=4) # Вертикальная линия на уровне медианы ppm
